# -*- coding: utf-8 -*-
# @Time    : 2020/06/24

import random

from PIL import Image
import os

#  pillow  尺寸： 20*22(画板大小)
show_figure = [
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0],
    [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0],
    [0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0],
    [0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0],
    [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0],
    [0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
]

# 行-y值   列-x值
# x行y列数值是多少？
# 模型show_figure 行数是多少？ 列数是多少？
# 设置每一个像素点，图片的大小（宽高）
PIC_WIDTH, PIC_HEIGHT = 100, 100
# 获取画板对应的行列数（用于图片填充）
row_num, column_num = len(show_figure), len(show_figure[0])

# 背景尺寸：     width*列数, height*行数
img = Image.open("bg_images/纯色.jpg").resize((2200, 2000))
image_names = os.listdir("photo/大话西游")
image_paths = []
for name in image_names:
    image_path = "photo/大话西游/" + name
    image_paths.append(image_path)


# 行扫描 range(n) => [0,1,2,3.....n-1]  左闭右开空间
# for 嵌套循环 先行后列
for row in range(row_num):
    # 列扫描
    for column in range(column_num):
        # 非零为True（只在指定的点，进行图片粘贴，构成对应的图案）
        if show_figure[row][column]:
            # 随机选择图片，及大小重置
            pic = Image.open(random.choice(image_paths)).resize((PIC_WIDTH, PIC_HEIGHT))
            # 在背景图上粘贴图片
            img.paste(pic, (PIC_WIDTH * column, PIC_HEIGHT * row))

        # print(row, column, show_figure[row][column])

# 保存图片到本地
img.save("wall.png")
